---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DecalSubcategoryId
source: html/feaf6635-949d-2944-6444-cb42e23a9130.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DecalSubcategoryId Property

"Subcategory"

## Syntax (C#)
```csharp
public static ForgeTypeId DecalSubcategoryId { get; }
```